/* =============================================================================
     ____    ___    ____    ___    _   _    ___    __  __   ___  __  __ TM
    |  _ \  |_ _|  / ___|  / _ \  | \ | |  / _ \  |  \/  | |_ _| \ \/ /
    | |_) |  | |  | |     | | | | |  \| | | | | | | |\/| |  | |   \  /
    |  __/   | |  | |___  | |_| | | |\  | | |_| | | |  | |  | |   /  \
    |_|     |___|  \____|  \___/  |_| \_|  \___/  |_|  |_| |___| /_/\_\

    Copyright (c) 2018 Pieter Conradie <https://piconomix.com>
 
    License: MIT
    https://github.com/piconomix/px-fwlib/blob/master/LICENSE.md
 
    Title:          px_gt511.h : ADH Tech GT-511 Fingerprint sensor driver
    Author(s):      Pieter Conradie
    Creation Date:  2018-07-17

============================================================================= */

/* _____STANDARD INCLUDES____________________________________________________ */

/* _____PROJECT INCLUDES_____________________________________________________ */
#include "px_gt511.h"
#include "px_uart.h"
#include "px_systmr.h"
#include "px_sysclk.h"
#include "px_log.h"

/* _____LOCAL DEFINITIONS____________________________________________________ */
PX_LOG_NAME("px_gt511");

/// @name GT511 Commands
/// @{
#define PX_GT511_CMD_OPEN                   0x01    ///< Initialization
#define PX_GT511_CMD_CLOSE                  0x02    ///< Termination
#define PX_GT511_CMD_USB_CHECK              0x03    ///< Check if the connected USB device is valid
#define PX_GT511_CMD_CHANGE_BAUD            0x04    ///< Change UART baud rate
#define PX_GT511_CMD_SET_IAP_MODE           0x05    ///< Enter IAP Mode. In this mode, FW Upgrade is available
#define PX_GT511_CMD_CMOS_LED               0x12    ///< Control CMOS LED
#define PX_GT511_CMD_GET_ENROLL_COUNT       0x20    ///< Get enrolled fingerprint count
#define PX_GT511_CMD_CHECK_ENROLLED         0x21    ///< Check whether the specified ID is already enrolled
#define PX_GT511_CMD_ENROLL_START           0x22    ///< Start an enrollment
#define PX_GT511_CMD_ENROLL_1               0x23    ///< Make 1st template for an enrollment
#define PX_GT511_CMD_ENROLL_2               0x24    ///< Make 2nd template for an enrollment
#define PX_GT511_CMD_ENROLL_3               0x25    ///< Make 3rd template for an enrollment, merge three templates into one template, save merged template to the database
#define PX_GT511_CMD_IS_PRESS_FINGER        0x26    ///< Check if a finger is placed on the sensor
#define PX_GT511_CMD_DELETE_ID              0x40    ///< Delete the fingerprint with the specified ID
#define PX_GT511_CMD_DELETE_ALL             0x41    ///< Delete all fingerprints from the database
#define PX_GT511_CMD_VERIFY                 0x50    ///< 1:1 Verification of the capture fingerprint image with the specified ID
#define PX_GT511_CMD_IDENTIFY               0x51    ///< 1:N Identification of the capture fingerprint image with the database
#define PX_GT511_CMD_VERIFY_TEMPLATE        0x52    ///< 1:1 Verification of a fingerprint template with the specified ID
#define PX_GT511_CMD_IDENTIFY_TEMPLATE      0x53    ///< 1:N Indentification of a fingerprint template with the database
#define PX_GT511_CMD_CAPTURE_FINGER         0x60    ///< Capture a fingerprint image(256x256) from the sensor
#define PX_GT511_CMD_MAKE_TEMPLATE          0x61    ///< Make template for transmission
#define PX_GT511_CMD_GET_IMAGE              0x62    ///< Download the captured fingerprint image(256x256)
#define PX_GT511_CMD_GET_RAW_IMAGE          0x63    ///< Capture & Download raw fingerprint image(320x240)
#define PX_GT511_CMD_GET_TEMPLATE           0x70    ///< Download the template of the specified ID
#define PX_GT511_CMD_SET_TEMPLATE           0x71    ///< Upload the template of the specified ID
#define PX_GT511_CMD_ACK                    0x30    ///< Acknowledge
#define PX_GT511_CMD_NACK                   0x31    ///< Non-acknowledge
/// @}

/// GT511 Command Packet
typedef struct
{
    uint8_t  start_code1;       ///< 0x55
    uint8_t  start_code2;       ///< 0xaa
    uint16_t device_id;         ///< 0x001
    uint32_t param;
    uint16_t cmd;
    uint16_t checksum;
} px_gt511_cmd_packet_t;

/// GT511 Response Packet
typedef struct
{
    uint8_t  start_code1;       ///< 0x55
    uint8_t  start_code2;       ///< 0xaa
    uint16_t device_id;         ///< 0x001
    uint32_t param;
    uint16_t resp;
    uint16_t checksum;
} px_gt511_resp_packet_t;

/// GT511 Data Packet (variable length data and checksum excluded)
typedef struct
{
    uint8_t  start_code1;       ///< 0x5a
    uint8_t  start_code2;       ///< 0xa5
    uint16_t device_id;         ///< 0x001
} px_gt511_data_packet_t;


/// Receive timeout (in milliseconds)
#define PX_GT511_RX_TIMEOUT_MS              200

/// Identify / verify timeout (in milliseconds)
#define PX_GT511_ID_TIMEOUT_MS              2000

/// Image timeout (in milliseconds)
#define PX_GT511_IMAGE_TIMEOUT_MS           1000

/// Enroll timeout (in milliseconds)
#define PX_GT511_ENROLL_TIMEOUT_MS          1000

/// Delete timeout (in milliseconds)
#define PX_GT511_DELETE_TIMEOUT_MS          1000

/// Receive interbyte timeout (in milliseconds)
#define PX_GT511_RX_INTERBYTE_TIMEOUT_MS    100

/// Receive buffer flush timeout (in milliseconds)
#define PX_GT511_RX_FLUSH_TIMEOUT_MS        100

/* _____MACROS_______________________________________________________________ */

/* _____GLOBAL VARIABLES_____________________________________________________ */

/* _____LOCAL VARIABLES______________________________________________________ */
